INSERT INTO `жанры` (`название`)
VALUES 
    ('Фантастика'),
    ('Фэнтези'),
    ('Детектив'),
    ('Ужасы'),
    ('Приключение'),
    ('Триллер')
;

INSERT INTO `книги` (`isbn`, `название`, `количество страниц`, `дата публикации`)
VALUES
    ('9785001398141', 'Сато', 380, '2020-08-14'),
    ('9785532939141', 'Космический наемник', 2387, '2021-03-17'),
    ('9781112939141', 'Церера. Сияние полуночного золота', 543, '2021-01-13'),
    ('9785389191020', 'Приключения Арсена Люпена', 126, '2022-12-04'),
    ('9785005532909', 'Пустившие по ветру. Роман', 452, NULL),
    ('9785129191020', 'Секреты Родни Длаба', 351, '2021-05-01'),
    ('9785041633974', 'Разрушенный трон', 739, '2021-02-15'),
    ('9785389205437', 'Крысиный остров и другие истории', 355, '2021-07-19')
;

INSERT INTO `авторы` (`имя`, `фамилия`)
VALUES
    ('Рагим', 'Джафаров'),
    ('Александр', 'Низаев'),
    ('Мелани', 'Рик'),
    ('Морис', 'Леблан'),
    ('Дина', 'Клопова'),
    ('Нея', 'Соулу'),
    ('Ю', 'Несбё')
;


INSERT INTO `авторство` (`автор`, `книга`)
VALUES
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Рагим'
            AND `фамилия` = 'Джафаров')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785001398141')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Александр'
            AND `фамилия` = 'Низаев')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785532939141')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Мелани'
            AND `фамилия` = 'Рик')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9781112939141')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Морис'
            AND `фамилия` = 'Леблан')
    ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785389191020')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Дина'
            AND `фамилия` = 'Клопова')
    ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785005532909')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Нея'
            AND `фамилия` = 'Соулу')
    ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785129191020')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Нея'
            AND `фамилия` = 'Соулу')
    ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785041633974')
    ),
    (
        (SELECT `id` 
        FROM `авторы` 
        WHERE `имя` = 'Ю'
            AND `фамилия` = 'Несбё')
    ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785389205437')
    )
;

INSERT INTO `жанр_книги` (`жанр`, `книга`)
VALUES
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Фантастика')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785001398141')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Триллер')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785001398141')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Фантастика')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785532939141')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Фантастика')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9781112939141')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Детектив')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785389191020')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Ужасы')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785005532909')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Фантастика')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785005532909')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Приключение')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785129191020')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Фэнтези')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785041633974')
    ),
    (
        (SELECT `id`
        FROM `жанры`
        WHERE `название` = 'Триллер')
        ,
        (SELECT `id`
        FROM `книги`
        WHERE `isbn` = '9785389205437')
    )
;